cf/Enums/ApplicationsStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ApplicationsStates</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IsNew</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Done</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BeingPreparedForUse</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Used</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Converting</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Copying</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ForDeletion</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>isDeleted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Missing</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PreparationError</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ImportFromFile</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ApplicationMigration</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ApplicationsStates/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// Returns enumeration value by value name.
//
// Parameters:
//  EnumValueName	- String - Value name as it is passed via API.
// 
// Returns:
//  EnumRef.ApplicationsStates - Enumeration value by its name.
//
Function ValueByName(EnumValueName) Export
    
    If EnumValueName = "ready" Then
        Return PredefinedValue("Enum.ApplicationsStates.Done");
    ElsIf EnumValueName = "preparation" Then
        Return PredefinedValue("Enum.ApplicationsStates.BeingPreparedForUse");
    ElsIf EnumValueName = "used" Then
        Return PredefinedValue("Enum.ApplicationsStates.Used");
    ElsIf EnumValueName = "converted" Then
        Return PredefinedValue("Enum.ApplicationsStates.Converting");
    ElsIf EnumValueName = "copied" Then
        Return PredefinedValue("Enum.ApplicationsStates.Copying");
    ElsIf EnumValueName = "decommissioned" Then
        Return PredefinedValue("Enum.ApplicationsStates.ForDeletion");
    ElsIf EnumValueName = "new" Then
        Return PredefinedValue("Enum.ApplicationsStates.IsNew");
    ElsIf EnumValueName = "error" Then
        Return PredefinedValue("Enum.ApplicationsStates.PreparationError");
    ElsIf EnumValueName = "removed" Then
        Return PredefinedValue("Enum.ApplicationsStates.isDeleted");
    Else
        Return PredefinedValue("Enum.ApplicationsStates.EmptyRef");
    EndIf; 
    
EndFunction

#EndRegion

#EndIf
